Repository: andentze/faceeu
Catalog: locales/*/LC_MESSAGES/tools.sort.cli.po
Languages: ru

source: This command lets you sort images using various methods.
ru: Эта команда позволяет вам сортировать изображения, используя различные методы.

source: Adjust the '-t' ('--threshold') parameter to control the strength of grouping.
ru: Настройте параметр '-t' ('--threshold') для контроля силы группировки.

source: Adjust the '-b' ('--bins') parameter to control the number of bins for grouping. Each image is allocated to a bin by the percentage of color pixels that appear in the image.
ru: Настройте параметр '-b' ('--bins') для управления количеством хранилищ для группировки. Каждое изображение распределяется по хранилищам в зависимости от процента цветных пикселей, присутствующих в изображениях.

source: Adjust the '-b' ('--bins') parameter to control the number of bins for grouping. Each image is allocated to a bin by the number of degrees the face is orientated from center.
ru: Настройте параметр '-b' ('--bins') для управления количеством хранилищ для группировки. Каждое изображение распределяется по хранилищам по количеству градусов, на которые лицо ориентировано от центра.

source: Adjust the '-b' ('--bins') parameter to control the number of bins for grouping. The minimum and maximum values are taken for the chosen sort metric. The bins are then populated with the results from the group sorting.
ru: Настройте параметр '-b' ('--bins') для управления количеством хранилищ для группировки. Для выбраной метрики сортировки берутся минимальное и максимальное значения. Затем хранилища заполняются результатами групповой сортировки.

source: faces by blurriness.
ru: лица по размытости.

source: faces by fft filtered blurriness.
ru: лица по фильтру размытости по быстрому преобразованию Фурье.

source: faces by the estimated distance of the alignments from an 'average' face. This can be useful for eliminating misaligned faces. Sorts from most like an average face to least like an average face.
ru: лица по примерной дистанции соотношений от 'среднего' лица. Может быть полезно для удаления неверно соотнесённых лиц. Сортирует от наиболее вероятно похожее на лицо до наименее вероятного.

source: faces using VGG Face2 by face similarity. This uses a pairwise clustering algorithm to check the distances between 512 features on every face in your set and order them appropriately.
ru: лица, используя VGG Face2 по схожести лиц. Использует алгоритм попарной кластеризации, чтобы проверить дистанцию между 512 функциями на каждом лице в вашем сетей и правильно их расположит.

source: faces by their landmarks.
ru: лица по их соотношениях.

source: Like 'face-cnn' but sorts by dissimilarity.
ru: Как 'face-cnn', но сортирует по несхожести.

source: faces by Yaw (rotation left to right).
ru: лица по рысканию (поворот слева на право).

source: faces by Pitch (rotation up and down).
ru: лица по высоте (поворот вверх и вниз).

source: faces by Roll (rotation). Aligned faces should have a roll value close to zero. The further the Roll value from zero the higher liklihood the face is misaligned.
ru: лица по вращению (повороту). Соотнесённые лица должны иметь значение вращения близкое к нулю. Чем дальше значение вращения от нуля, тем выше вероятность, что лицо неверно соотнесено.

source: faces by their color histogram.
ru: лица по их цветовой гистограмме.

source: Like 'hist' but sorts by dissimilarity.
ru: Как 'hist', но сортирует по несхожести.

source: images by the average intensity of the converted grayscale color channel.
ru: изображения по средней интенсивности серого цветового канала.

source: images by their number of black pixels. Useful when faces are near borders and a large part of the image is black.
ru: изображения по их количеству чёрных пикселей. Полезно, когда лица находятся возле краёв и огромная часть изображения чёрная.

source: images by the average intensity of the converted Y color channel. Bright lighting and oversaturated images will be ranked first.
ru: изображения по средней интенсивности цветового канала Y. Яркое освещение и перенасыщенные изображения будут на первом месте.

source: images by the average intensity of the converted Cg color channel. Green images will be ranked first and red images will be last.
ru: изображения по средней интенсивности цветового канала Cg. Зелёные изображения будут на первом месте, красные - на последнем.

source: images by the average intensity of the converted Co color channel. Orange images will be ranked first and blue images will be last.
ru: изображения по средней интенсивности цветового канала Co. Оранжевые изображения будут на первом месте, синие - на последнем.

source: images by their size in the original frame. Faces further from the camera and from lower resolution sources will be sorted first, whilst faces closer to the camera and from higher resolution sources will be sorted last.
ru: изображения по их размеру в кадре. Лица дальше от камеры и от источников с менее высоким разрешением будут на первом месте, в то время как лица ближе к камере и из источников с более высоким разрешением будут на последнем месте.

source: option is deprecated. Use 'yaw'
ru: опция исключена. Используйте 'yaw'

source: option is deprecated. Use 'color-black'
ru: опция исключена. Используйте 'color-black'

source: Sort faces using a number of different techniques
ru: Сортируйте лица различными способами

source: data
ru: данные

source: Input directory of aligned faces.
ru: Входной каталог соотнесённых лиц.

source: Output directory for sorted aligned faces. If not provided and 'keep' is selected then a new folder called 'sorted' will be created within the input folder to house the output. If not provided and 'keep' is not selected then the images will be sorted in-place, overwriting the original contents of the 'input_dir'
ru: Выходной каталог отсортированных соотнесённых лиц. Если не установлено и выбрана опция 'keep', тогда будет создана новая папка 'sorted 'внутри входной папки для выхода. Если не установлено и опция 'keep' не выбрана, тогда изображения будут отсортированы на месте, переписывая исходное содержимое исходное 'input_dir'

source: R|If selected then the input_dir should be a parent folder containing multiple folders of faces you wish to sort. The faces will be output to separate sub-folders in the output_dir
ru: R|Если выбрано, 'input_dir' должен быть родительской папской, содержащее несколько папок с лицами, которые вы хотите отсортировать. Лица будут выходить в отдельные суб-каталоги в выходном каталоге

source: sort settings
ru: настройки сортировки

source: R|Choose how images are sorted. Selecting a sort method gives the images a new filename based on the order the image appears within the given method. L|'none': Don't sort the images. When a 'group-by' method is selected, selecting 'none' means that the files will be moved/copied into their respective bins, but the files will keep their original filenames. Selecting 'none' for both 'sort-by' and 'group-by' will do nothing
ru: R|Выберите как лица будут сортированы. Выбор метода сортировки даёт изображениям новое имя, основанное на порядке появления изображения каким-либо методом. L|'none': Не сортировать изображения. Когда выбран метод 'group-by', выбор 'none' значит, что файлы будут перемещены/скопированы в их соответственные хранилища, но файлы оставят свои исходные названия. Выбор 'none' для 'sort-by' и 'group-by' ничего не даст

source: group settings
ru: настройки группировки

source: R|Selecting a group by method will move/copy files into numbered bins based on the selected method. L|'none': Don't bin the images. Folders will be sorted by the selected 'sort-by' but will not be binned, instead they will be sorted into a single folder. Selecting 'none' for both 'sort-by' and 'group-by' will do nothing
ru: R|Выбор группы по методу переместит/скопирует файлы в пронумерованных хранилища, основанные на выбранном методе. L|'none': Не группировать изображения. Папки будут отсортированы выбранным 'sort-by', но не будут сгруппированы, вместо этого, они будут отсортированы в единую папку. Выбор 'none' для 'sort-by' и 'group-by' ничего не даст

source: Whether to keep the original files in their original location. Choosing a 'sort-by' method means that the files have to be renamed. Selecting 'keep' means that the original files will be kept, and the renamed files will be created in the specified output folder. Unselecting keep means that the original files will be moved and renamed based on the selected sort/group criteria.
ru: Оставлять исходные файлы в их исходных папках или нет. Выбор метода 'sort-by' значит, что файлы должны быть переименованы. Выбрав 'keep', значит, что исходные файлы останутся, и переименованые файлы будут созданы в указанной выходной папке. Снятие 'keep' значит, что исходные файлы будут перемещены и переименованы, основываясь на выбранной критерии сортировки/группировки.

source: R|Float value. Minimum threshold to use for grouping comparison with 'face-cnn' 'hist' and 'face' methods. The lower the value the more discriminating the grouping is. Leaving -1.0 will allow Faceswap to choose the default value. L|For 'face-cnn' 7.2 should be enough, with 4 being very discriminating. L|For 'hist' 0.3 should be enough, with 0.2 being very discriminating. L|For 'face' between 0.1 (more bins) to 0.5 (fewer bins) should be about right. Be careful setting a value that's too extrene in a directory with many images, as this could result in a lot of folders being created. Defaults: face-cnn 7.2, hist 0.3, face 0.25
ru: R|Значение с плавающей точкой. Минимальный для использования порог для сравнения группировки с методами 'face-cnn', 'hist' и 'face'. Чем ниже значение, тем более дифференцированной будет группировка. Оставив -1.0, позволит Faceswap выбрать значение по умолчанию. L|

source: output
ru: выход

source: settings
ru: настройки
